app/controllers/activities_controller.rb

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def show
    @users = users_with_activity
    @activity = Activity.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."name" = $1 LIMIT $2  [["name", "Close with my Coworkers"], ["LIMIT", 1]]
INSERT INTO "activities" ("name", "category", "points", "created_at", "updated_at", "accomplished") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "read a book"], ["category", "Intellectual"], ["points", 10], ["created_at", "2017-10-26 18:18:02.468773"], ["updated_at", "2017-10-26 18:18:02.468773"], ["accomplished", "f"]]
---
  def create
    @user = User.find_by(id: params[:user_id]) #to associate the new activity with the user making it
    previous_activity = Activity.find_by(name: params[:activity]) #finds previoius activity with same name
    @activity = previous_activity.dup #makes a copy of the previous activity
    @activity.accomplished = false #sets accomplished to false on the new activity
    @activity.save #saves the activity

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 26]]
---
  def delete
   @activity = Activity.find_by(id: params[:activity_id])
   @activity.destroy

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
UPDATE "activities" SET "accomplished" = $1, "updated_at" = $2 WHERE "activities"."id" = $3  [["accomplished", "t"], ["updated_at", "2017-10-26 13:37:12.262506"], ["id", 27]]
---
 def update
   @activity = Activity.find_by(id: params[:activity_id])
   @user = @activity.user_ids
   @activity.accomplished = true
   @activity.save