app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ramy"], ["LIMIT", 1]]
---
  def create
    # binding.pry
   user = User.find_by(username:params[:username])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def find_user
    @user = User.find_by(id: params[:id])