app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
      if @user.save && params[:password] == params[:password_confirmation] #should be user_params both times??

SELECT DISTINCT "activities"."name" FROM "activities"
SELECT "activities".* FROM "activities" INNER JOIN "user_activities" ON "activities"."id" = "user_activities"."activity_id" WHERE "user_activities"."user_id" = $1 AND "activities"."accomplished" = $2  [["user_id", 1], ["accomplished", "t"]]
---
   def show
     find_user
     @grouped_user_fitness = grouped_user_fitness
     @grouped_user_relationship = grouped_user_relationship
     @grouped_user_intellectual = grouped_user_intellectual
     @grouped_user_purpose = grouped_user_purpose
     @grouped_user_professional = grouped_user_professional

     @grouped_fitness_achievements = grouped_fitness_achievements
     @grouped_relationship_achievements = grouped_relationship_achievements
     @grouped_intellectual_achievements = grouped_intellectual_achievements
     @grouped_purpose_achievements = grouped_purpose_achievements
     @grouped_professional_achievements = grouped_professional_achievements

     @activities_list = Activity.distinct.pluck(:name)
     @public_achievements = find_user.achievements
     @unaccomplished_activities = find_user.activities.where(accomplished: false)

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$cp.fv1N2veFphzibm6utlOceEmQM2qfQv5ZkYeVC7R5lOsb.ULw4i"], ["updated_at", "2017-10-26 12:24:01.107597"], ["id", 1]]
---
  def update
    find_user
    @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    find_user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def find_user
    @user = User.find_by(id: params[:id])